app/views/checkout/address.html.erb

            <div class="col-md-8" >
                <% find_address = current_user.addresses.count %>
                <% address1 = current_user.addresses.first %>
---
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`user_id` = 51 ORDER BY `addresses`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `addresses` WHERE `addresses`.`user_id` = 51

                <tr>
                    <td><% item.dish.pictures.each do |p| %>
---
SELECT  `dishes`.* FROM `dishes` WHERE `dishes`.`id` = 151 LIMIT 1