app/views/checkout/cart.html.erb

<div class="container">
	<% count_cart = @current_cart.line_items.count %>
---
SELECT COUNT(*) FROM `line_items` WHERE `line_items`.`cart_id` = 198

							<%= link_to dish_path(item.dish) do %>
								<% item.dish.pictures.each do |p| %>
---
SELECT  `dishes`.* FROM `dishes` WHERE `dishes`.`id` = 151 LIMIT 1

							</p>
							<% item.dish.restaurants.each do |r| %>
---
SELECT `restaurants`.* FROM `restaurants` INNER JOIN `dishes_restaurants` ON `restaurants`.`id` = `dishes_restaurants`.`restaurant_id` WHERE `dishes_restaurants`.`dish_id` = 151