app/views/checkout/payment.html.erb

SELECT  `dishes`.* FROM `dishes` WHERE `dishes`.`id` = 151 LIMIT 1
---
		        <tr>
			        <td><% item.dish.pictures.each do |p| %>