app/controllers/admin/dishes_controller.rb

SELECT  `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 48 LIMIT 1
SELECT `dishes`.* FROM `dishes` INNER JOIN `dishes_restaurants` ON `dishes`.`id` = `dishes_restaurants`.`dish_id` WHERE `dishes_restaurants`.`restaurant_id` = 48
SELECT AVG(`ratings`.`rating`) FROM `ratings` WHERE `ratings`.`dish_id` = 55
---
	def index
    @restaurant = Restaurant.find(params[:restaurant_id])
    @dishes =   @restaurant.dishes.all
    @ratings = Dish.by_rating.all

SELECT  `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 48 LIMIT 1
SELECT  `dishes`.* FROM `dishes` WHERE `dishes`.`id` = 55 LIMIT 1
---
  def edit
    @restaurant = Restaurant.find(params[:restaurant_id])
    @dish = Dish.find(params[:id])