app/controllers/admin/orders_controller.rb

SELECT  `orders`.* FROM `orders` ORDER BY `orders`.`created_at` ASC LIMIT 4 OFFSET 0
---
	def index
    @orders = Order.all.order(created_at: :asc).paginate(page:  params[:page], per_page: 4)