app/views/shared/_nav.html.erb

                  <li class="nav-item">
                    <% count_list = current_user.wishlists.count %>
---
SELECT COUNT(*) FROM `wishlists` WHERE `wishlists`.`user_id` = 51

                  <li class="nav-item">
                    <% count_cart = @current_cart.line_items.count %>
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 201
SELECT COUNT(*) FROM `line_items` WHERE `line_items`.`cart_id` = 205

                      <% total_count = 0 %>
                      <% @current_cart.line_items.each do |item| %>
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 201

                  <li class="nav-item">
                    <% count_cart = @current_cart.line_items.count %>
---
SELECT COUNT(*) FROM `line_items` WHERE `line_items`.`cart_id` = 206

                      <% total_count = 0 %>
                      <% @current_cart.line_items.each do |item| %>
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 201