app/views/admin/restaurants/index.html.erb

            <% end %></td>
        <td><%= truncate(r.locations.pluck(:street, :city).join(',')) %></td>
        <td><%= truncate(r.dishes.pluck(:name).join(',')) %></td>
---
SELECT `locations`.`street`, `locations`.`city` FROM `locations` INNER JOIN `locations_restaurants` ON `locations`.`id` = `locations_restaurants`.`location_id` WHERE `locations_restaurants`.`restaurant_id` = 48
SELECT `dishes`.`name` FROM `dishes` INNER JOIN `dishes_restaurants` ON `dishes`.`id` = `dishes_restaurants`.`dish_id` WHERE `dishes_restaurants`.`restaurant_id` = 48