app/views/home/_dishes.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 51 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `wishlists`.* FROM `wishlists` WHERE `wishlists`.`dish_id` = 153
---
            <% if current_user.present? %>
              <% pre_wishlisted = d.wishlists.find { |wishlist| wishlist.user_id == current_user.id} %>

SELECT `restaurants`.* FROM `restaurants` INNER JOIN `dishes_restaurants` ON `restaurants`.`id` = `dishes_restaurants`.`restaurant_id` WHERE `dishes_restaurants`.`dish_id` = 153
---
              <h2><%= d.name %></h2>
              <% d.restaurants.each do |r|%>

SELECT `restaurants`.* FROM `restaurants` INNER JOIN `dishes_restaurants` ON `restaurants`.`id` = `dishes_restaurants`.`restaurant_id` WHERE `dishes_restaurants`.`dish_id` = 149
---
        <div class="dish_btm">
          <% d.restaurants.each do |r| %>