app/views/orders/show.html.erb

					<div>
		        <% @order.line_items.each do |d| %>
  		        <% d.dish.pictures.each do |p| %>
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`order_id` = 6
SELECT  `dishes`.* FROM `dishes` WHERE `dishes`.`id` = 151 LIMIT 1