app/views/dishes/_all_reviews.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 51 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`dish_id` = 151
---
<% pre_rated = @dish.ratings.find { |rating| rating.user_id == current_user.id} %>