app/views/dishes/_overall_rating.html.erb

SELECT AVG(`ratings`.`rating`) FROM `ratings` WHERE `ratings`.`dish_id` = 151
SELECT COUNT(`ratings`.`rating`) FROM `ratings` WHERE `ratings`.`dish_id` = 151
---
  <h4>Overall Rating &nbsp;
    <%= @dish.ratings.average(:rating).present? ? @dish.ratings.average(:rating).round(1) : 0 %>
    <i class="review-rating" data-score = " <%= @dish.ratings.average(:rating).present? ? @dish.ratings.average(:rating).round(1) : 0 %>"></i>
  </h4><br><i >Based on <%= @dish.ratings.count(:rating) %> Reviews</i><br>

SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`dish_id` = 151 AND `ratings`.`rating` = 5
---
  <div>
     <i class="review-rating" data-score = "5"></i> &nbsp;<span>(<%= @dish.ratings.where(rating: 5).count %>)</span>

SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`dish_id` = 151 AND `ratings`.`rating` = 4
---
  <div>
   <i class="review-rating" data-score = "4"></i> &nbsp;<span>(<%= @dish.ratings.where(rating: 4).count %>)</span>

SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`dish_id` = 151 AND `ratings`.`rating` = 3
---
  <div>
    <i class="review-rating" data-score = "3"></i> &nbsp;<span>(<%= @dish.ratings.where(rating: 3).count %>)</span>

SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`dish_id` = 151 AND `ratings`.`rating` = 2
---
  <div>
    <i class="review-rating" data-score = "2"></i> &nbsp;<span>(<%= @dish.ratings.where(rating: 2).count %>)</span>

SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`dish_id` = 151 AND `ratings`.`rating` = 1
---
  <div>
    <i class="review-rating" data-score = "1"></i> &nbsp;<span>(<%= @dish.ratings.where(rating: 1).count %>)</span>