app/views/dishes/show.html.erb

SELECT `restaurants`.* FROM `restaurants` INNER JOIN `dishes_restaurants` ON `restaurants`.`id` = `dishes_restaurants`.`restaurant_id` WHERE `dishes_restaurants`.`dish_id` = 151
---
      <p class="restra-txt" style = "border-bottom: 2px solid #d8d8d8;">
        <% @dish.restaurants.each do |r| %>

SELECT `wishlists`.* FROM `wishlists` WHERE `wishlists`.`dish_id` = 151
---
          <% if current_user.present? %>
            <% pre_wishlisted = @dish.wishlists.find { |wishlist| wishlist.user_id == current_user.id} %>

SELECT  `dishes`.* FROM `dishes` ORDER BY `dishes`.`id` ASC LIMIT 1
---

    <% unless  @dish.id == Dish.first.id   %>

SELECT  `dishes`.* FROM `dishes` ORDER BY `dishes`.`id` DESC LIMIT 1
---

    <% unless  @dish.id == Dish.last.id   %>

SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`dish_id` = 151
---
          <% if current_user.present? %>
            <% pre_rated = @dish.ratings.find { |rating| rating.user_id == current_user.id} %>

SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`dish_id` = 151
---
      <div class="review_left"  >
        <% @dish.ratings.each do |rate| %>