app/controllers/addresses_controller.rb

	def index
    @addresses = Address.where(:user_id => current_user)
---
SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`user_id` = 51

  def edit
    @address = Address.find(params[:id])
---
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 47 LIMIT 1

  def update
   @address = Address.find(params[:id])
---
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 47 LIMIT 1