app/controllers/carts_controller.rb

DELETE FROM `carts` WHERE `carts`.`id` = 201
---
  def destroy
    @cart = @current_cart
    @cart.destroy