app/controllers/checkout_controller.rb

    def address
      @cart = @current_cart
      @address = Address.new
      @user_address = Address.where(:user_id => current_user)
---
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`user_id` = 51 ORDER BY `addresses`.`id` ASC LIMIT 1

    def payment
      @cart = @current_cart
      @select_address = Address.find(params[:address_id])
---
SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 49 LIMIT 1