app/controllers/dishes_controller.rb

SELECT  `dishes`.* FROM `dishes` WHERE `dishes`.`id` = 151 LIMIT 1
---
  def show

    @dish = Dish.find(params[:id])