app/controllers/home_controller.rb

  def index
    if  params[:location]
      @locations = Location.where("city LIKE ?", "%#{params[:location]}%")
      restaurants = []
      location_dishes = []
        @locations.each do |l|
          l.restaurants.each do |r|
            restaurants.push(r)
              r.dishes.each do |d|
                location_dishes.push(d)
              end
          end
        end
      @dishes = location_dishes.paginate(:page => params[:page], :city => params[:location], :per_page => 50)
    else
      @dishes = Dish.order(created_at: :desc).paginate(:page => params[:page], :per_page => 6)
---
SELECT  `dishes`.* FROM `dishes` ORDER BY `dishes`.`created_at` DESC LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM `dishes`

  def search
    map_location
    if  params[:search]
    @dishes = Dish.paginate(page: params[:page],:per_page => 6).where("name LIKE ?", "%#{params[:search]}%")
---
SELECT  `dishes`.* FROM `dishes` WHERE (name LIKE '%ssssssssssss%') LIMIT 6 OFFSET 0

  def map_location
    @dishes = Dish.all.where("name LIKE ?", "%#{params[:search]}%")
    locations = []
    restaurant = []
    @dishes.each do |d|
---
SELECT `dishes`.* FROM `dishes` WHERE (name LIKE '%ssssssssssss%')