app/controllers/line_items_controller.rb

SELECT  `dishes`.* FROM `dishes` WHERE `dishes`.`id` = 151 LIMIT 1
SELECT  1 AS one FROM `dishes` INNER JOIN `line_items` ON `dishes`.`id` = `line_items`.`dish_id` WHERE `line_items`.`cart_id` = 201 AND `dishes`.`id` = 151 LIMIT 1
SELECT  `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 201 AND `line_items`.`dish_id` = 151 LIMIT 1
INSERT INTO `line_items` (`dish_id`, `cart_id`, `created_at`, `updated_at`) VALUES (151, 201, '2020-01-23 09:55:15', '2020-01-23 09:55:15')
UPDATE `line_items` SET `quantity` = 2, `updated_at` = '2020-01-23 09:55:50' WHERE `line_items`.`id` = 204
---
  def create
    chosen_product = Dish.find(params[:dish_id])
    current_cart = @current_cart

    # If cart already has this product then find the relevant line_item and iterate quantity otherwise create a new line_item for this product
    if current_cart.dishes.include?(chosen_product)
      @line_item = current_cart.line_items.find_by(:dish_id => chosen_product)
      @line_item.quantity += 1
    else
      @line_item = LineItem.new
      @line_item.cart = current_cart
      @line_item.dish = chosen_product
    end
    # Save and redirect to cart show path
    @line_item.save!

SELECT  `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 204 LIMIT 1
UPDATE `line_items` SET `quantity` = 1, `updated_at` = '2020-01-23 09:55:53' WHERE `line_items`.`id` = 204
---
  def reduce_quantity
    @line_item = LineItem.find(params[:id])
    if @line_item.quantity > 1
      @line_item.quantity -= 1
    end
    @line_item.save