app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 51
---
	def index
		@orders = Order.where(:user_id => current_user)

SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`user_id` = 51 ORDER BY `addresses`.`id` DESC LIMIT 1
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 202
INSERT INTO `orders` (`user_id`, `amount`, `created_at`, `updated_at`, `payment_id`, `transaction_id`, `stripe_customer_id`, `payment`, `payment_type`, `address_id`, `order_status`) VALUES (51, 45, '2020-01-23 10:02:21', '2020-01-23 10:02:21', 'ch_1G42W0DL9zYXtHaJW4jHhf8O', 'txn_1G42W1DL9zYXtHaJJasuj4f4', 'cus_GbF04EZzYQeTRD', 'Success', 'Stripe', 49, 'Processed')
---
	def create
		@cart = @current_cart
		@order = Order.new
		customer = Stripe::Customer.create({
	    email: params[:stripeEmail],
	    source: params[:stripeToken],
	    name: current_user.name
	  })

	  charge = Stripe::Charge.create({
	    customer: customer.id,
	    amount: (@current_cart.sub_total * 100).floor,
	    description: "Dishes",
	    currency: 'INR',
	  })



	  #TODO: charge.paid or charge["paid"]
    if charge["paid"] == true

      @order = Order.new(
        user_id: current_user.id,
        amount: @current_cart.sub_total,
        address_id:current_user.addresses.last.id,
        payment_id: charge.id,
        transaction_id: charge.balance_transaction,
        stripe_customer_id: customer.id,
        payment_type: 'Stripe',
        payment: 'Success',
        order_status: 'Processed'
      )

      # @order = Order.new(order_params)

        @current_cart.line_items.each do |item|
		      @order.line_items << item

DELETE FROM `carts` WHERE `carts`.`id` = 202
---
		    end
		    @order.save

      Cart.destroy(session[:cart_id])

SELECT  `orders`.* FROM `orders` ORDER BY `orders`.`id` DESC LIMIT 1
---
	def success
		@payment = Order.last

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 6 LIMIT 1
---
	def show
		@order = Order.find(params[:id])