app/controllers/ratings_controller.rb

SELECT  `dishes`.* FROM `dishes` WHERE `dishes`.`id` = 148 LIMIT 1
INSERT INTO `ratings` (`rating`, `dish_id`, `created_at`, `updated_at`, `comments`, `user_id`, `user_name`) VALUES (5, 148, '2020-01-23 10:12:34', '2020-01-23 10:12:34', 'rajufffffff', 51, 'raju')
---
  def create
    @dish = Dish.find(rating_params[:dish_id])
    if already_rated?
      flash[:notice] = "You can't like more than once"
    else
      @rating = Rating.create(rating_params)

SELECT  1 AS one FROM `ratings` WHERE `ratings`.`user_id` = 51 AND `ratings`.`dish_id` = 148 LIMIT 1
---
  def already_rated?
    Rating.where(user_id: current_user.id, dish_id:
    rating_params[:dish_id]).exists?

SELECT  `ratings`.* FROM `ratings` WHERE `ratings`.`id` = 310 LIMIT 1
---
  def edit
    @rating = Rating.find(params[:id])

SELECT  `dishes`.* FROM `dishes` WHERE `dishes`.`id` = 151 LIMIT 1
SELECT  `ratings`.* FROM `ratings` WHERE `ratings`.`id` = 310 LIMIT 1
UPDATE `ratings` SET `comments` = 'sssssssssssssssss', `updated_at` = '2020-01-23 10:47:10' WHERE `ratings`.`id` = 310
---
  def update
    @dish = Dish.find(params[:dish_id])
    @rating = Rating.find(params[:id])

    respond_to do |format|
      if @rating.update_attributes(rating_params)