app/controllers/wishlists_controller.rb

SELECT  `dishes`.* FROM `dishes` WHERE `dishes`.`id` = 151 LIMIT 1
---
  def find_wishlist
    @dish = Dish.find(params[:dish_id])

SELECT  `dishes`.* FROM `dishes` WHERE `dishes`.`id` = 151 LIMIT 1
---
  def find_dish
    @dish = Dish.find(params[:dish_id])