app/views/wishlists/index.html.erb

SELECT COUNT(*) FROM `wishlists` WHERE `wishlists`.`user_id` = 51
---
	<% if current_user.present? %>
	   <% count_list = current_user.wishlists.count %>