app/views/admin/dishes/index.html.erb

SELECT AVG(`ratings`.`rating`) FROM `ratings` WHERE `ratings`.`dish_id` = 55
---
          <td>&#8377; <%= d.price %></td>
          <td><%= d.ratings.average(:rating) %></td>
          <td><%= d.ratings.count(:rating) %></td>